# Demo

This notebook will be used as planning for and structure durring a live demo of my progress during the PRIMRE Sequim meeting (6/4/24 - 6/6/24).

### Setup

In [29]:
import pandas as pd
import primrea.core

### Available Tables

In [2]:
primre_metadata = primrea.core.primrea_data()

In [15]:
primre_metadata.tethys_authors

       entry_id               author
0           499       Soukissian, T.
1           499           Denaxa, D.
2           499      Karathanasi, F.
3           499  Prospathopoulos, A.
4           499       Sarantakos, K.
...         ...                  ...
15873   2078986               Li, M.
15874   2078986             Wolf, J.
15875   2078986         Williams, A.
15876   2078986             Badoe, C
15877   2078986          Masters, I.

[15878 rows x 2 columns]

### Basic Analysis

In [16]:
tethys_authors = primre_metadata.tethys_authors

In [17]:
tethys_authors

       entry_id               author
0           499       Soukissian, T.
1           499           Denaxa, D.
2           499      Karathanasi, F.
3           499  Prospathopoulos, A.
4           499       Sarantakos, K.
...         ...                  ...
15873   2078986               Li, M.
15874   2078986             Wolf, J.
15875   2078986         Williams, A.
15876   2078986             Badoe, C
15877   2078986          Masters, I.

[15878 rows x 2 columns]

In [27]:
tethys_authors_unique = list(tethys_authors['author'].unique())
len(tethys_authors_unique)

8428

In [20]:
max(tethys_authors['author'])

'Širović, A.'

In [21]:
tethys_authors[tethys_authors['author']=='Širović, A.']

      entry_id       author
2512      1931  Širović, A.

In [23]:
author_associations = tethys_authors['author'].value_counts().reindex(tethys_authors['author'].unique()).tolist()

In [30]:
author_associations_df = pd.DataFrame({'author':tethys_authors_unique, 'associations':author_associations})

In [31]:
author_associations_df

                   author  associations
0          Soukissian, T.             6
1              Denaxa, D.             1
2         Karathanasi, F.             2
3     Prospathopoulos, A.             2
4          Sarantakos, K.             1
...                   ...           ...
8423             Wood, W.             1
8424            Marsh, A.             1
8425          Fischer, M.             1
8426                Li, X             1
8427             Badoe, C             1

[8428 rows x 2 columns]

In [32]:
author_associations_df['associations'].max()

109

In [33]:
author_associations_df[author_associations_df['associations']==109]

          author  associations
100  Copping, A.           109

In [37]:
author_associations_df.sort_values('associations', ascending=False)[:10]

           author  associations
100   Copping, A.           109
267   Polagye, B.            48
65      Scott, B.            47
83   Iglesias, G.            42
213    Hastie, G.            41
114   Freeman, M.            41
293   Roberts, J.            40
299  Sparling, C.            40
366      Bald, J.            39
215    Wilson, B.            38